title: Script Interpreter Execution (VBScript/JScript)
id: script-001
description: Detects cscript.exe or wscript.exe execution with suspicious parameters
status: production
author: Solomon James

logsource:
  product: windows
  service: sysmon
  definition: Event ID 1 - Process Creation

detection:
  keywords:
    - 'Image contains cscript.exe'
    - 'Image contains wscript.exe'
  
  suspicious:
    - 'CommandLine contains .vbs'
    - 'CommandLine contains .js'
    - 'CommandLine contains http'
    - 'CommandLine contains cmd'
  
  filter:
    User|equals: 'SYSTEM'
  
  condition: keywords and suspicious and not filter

level: medium
tags:
  - attack.execution
  - attack.t1059
